
const products = [
    {
        "name": "P47D Thunderbolt",
        "brand": "Tamiya",
        "scale": "1/48",
        "price": 45,
        "descr": "Le Republic P-47 Thunderbolt fut l'un des principaux chasseurs américains de la Seconde Guerre mondiale. Il est même l'avion de chasse américain le plus produit lors du conflit avec 15 660 exemplaires construits.",
        "picture": "Images/republic_p_47_thunderbolt_tamiya.jpg",
        "stock": 10,
    },
    {
        "name": "Me-262 Night-Fighter",
        "brand": "Revell",
        "scale": "1/32",
        "price": 45,
        "descr": "Le Messerschmitt Me 262, surnommé Schwalbe (Hirondelle en français) pour les versions de combat ou Sturmvogel (Oiseau de tempête) pour les versions chasseur-bombardier, fut le premier avion de chasse opérationnel à moteur à réaction de l'Histoire, construit par la société allemande Messerschmitt pendant la Seconde Guerre mondiale.",
        "picture": "Images/me-262.jpg",
        "stock": 3,
    },
    {
        "name": "Mirage 3",
        "brand": "Revell",
        "scale": "1/72",
        "price": 30,
        "descr": "Le Mirage III est un avion multirôle conçu par le constructeur aéronautique français Dassault Aviation à la fin des années 1950. C'est le premier avion de combat de conception européenne capable de dépasser une vitesse de Mach 2 en vol horizontal.",
        "picture": "Images/mirage3.jpg",
        "stock": 5,
    },
    {
        "name": "Sea Harrier FRS.1",
        "brand": "Italeri",
        "scale": "1/72",
        "price": 20,
        "descr": "Le Harrier est le premier avion à décollage et atterrissage vertical mis en service au monde. En pratique cependant, il est trop lourd pour décoller verticalement avec son équipement de combat, sans parler du fait que cette manœuvre consommerait beaucoup de carburant. Il est donc généralement plutôt utilisé comme STOVL (appareil à décollage court et atterrissage vertical), capable de se contenter de pistes de 180 mètres de long.",
        "picture": "Images/harrier.jpg",
        "stock": 0,
    },
    {
        "name": "F4U Corsair",
        "brand": "Tamiya",
        "scale": "1/48",
        "price": 50,
        "descr": "Le Corsair fut construit à 12571 exemplaires, y compris après la seconde guerre mondiale. S'il eut des débuts difficiles, au point d'être dans un premier temps refusé par l'US Navy pour ses opérations embarquées, il finit par faire la preuve de ses performances, de sa robustesse, et d'être amélioré pour devenir un vrai avion embarqué. Peu de chasseurs de cette époque peuvent se vanter d'avoir eu une si belle carrière.",
        "picture": "Images/f4u-1a-corsair.jpg",
        "stock": 7,
    },
    {
        "name": "FW 190",
        "brand": "Italeri",
        "scale": "1/72",
        "price": 35,
        "descr": "Le Focke-Wulf Fw 190 Würger (Pie-grièche) est un chasseur-bombardier monoplace et monomoteur utilisé par l'Allemagne pendant la Seconde Guerre mondiale, entre 1941 et 1945. Il ne supplanta pas complètement le Messerschmitt Bf 109 comme principal chasseur de la Luftwaffe, bien qu'il lui fût supérieur. Il fut produit à plus de 20 000 exemplaires.",
        "picture": "Images/fw190.jpg",
        "stock": 12,
    },
    {
        "name": "A6M2",
        "brand": "Tamiya",
        "scale": "1/32",
        "price": 35,
        "descr": "Le Mitsubishi A6M, mieux connu sous le nom de « zero », était un chasseur-bombardier de la seconde guerre mondiale utilisé par la marine impériale japonaise. Sa maniabilité, ainsi que sa légèreté, ont fait de cet avion un chasseur remarquable et redouté par ses adversaires.",
        "picture": "Images/a6m2.avif",
        "stock": 12,
    }
]
